#ifndef __MODBUSRTU_CLI_H_
#define __MODBUSRTU_CLI_H_
#include <stdint.h>


/*------------------------------------------------------------------------------------------*/
/*??RAM????  ??????1K  0x20003c00~0x20003fff                                    */
/*                                                                                          */
/*------------------------------------------------------------------------------------------*/ 
/*????????RAM?  0x20003c00~0x20003d00 256??--------------------------------------*/
#define USER_RAM		((uint8_t*)0x20003c00)




#define STATE_SIZE 		16//128										//×´Ì¬¼Ä´æÆ÷
#define INPUT_SIZE 		6//160										//ÊäÈë¼Ä´æÆ÷
#define COIL_SIZE 		32//256										//ÏßÈ¦¼Ä´æÆ÷
#define HOLD_SIZE 		6//160										//±£³Ö¼Ä´æÆ÷


/*????????RAM?  0x20003fc0~0x20003fff 64??---------------------------------------*/

/*MODBUS ??????-----------------------------------------------------------------------*/
#define REG_LINE 	0												//?????? ??0?
#define REG_MODBUS 	1												//MODBUD???? ???0?00001,1?10001,3?30001,4?40001
#define COIL_ON  	PIO_ON											//?????
#define COIL_OFF 	PIO_OFF											//?????
#define STATE_ON 	1												//?????
#define STATE_OFF 	0												//?????



#endif
